In [1]:
import pandas as pd

df = pd.DataFrame({"device_id": ['D475', 'D175', 'D200', 'D375', 'M475', 'M400', 'M250', 'A150'],
                   "device_temperature": [35.4, 45.2, 59.3, 49.3, 32.2, 35.7, 36.8, 34.9],
                   "device_status": ["Inactive", "Active", "Active", "Active", "Active", "Inactive", "Active", "Active"]})

df1 = pd.DataFrame({"device_id": ['D475', 'D175', 'D200', 'D375', 'M475', 'M400', 'M250', 'A150'],
                   "device_temperature": [39.4, 45.2, 29.3, 49.3, 32.2, 35.7, 36.8, 24.9],
                   "device_status": ["Active", "Active", "Inactive", "Active", "Active", "Inactive", "Active", "Inactive"]})

In [2]:
#Case 1: Compare two Series having the same shape, same data at the same position
series1 = pd.Series([1,2,3,4])
series2 = pd.Series([1,2,3,4])
series1.equals(series2)

## Output
#True

#Case 2: Compare two Series having different shapes
series1 = pd.Series([1,2,3,4,5,6])
series2 = pd.Series([1,2,4,4])
series1.equals(series2)

## Output
#False

#Case 3: Compare two Series having the same shape but different order of the data
series1 = pd.Series([1,2,3,4])
series2 = pd.Series([2,1,3,4])
series1.equals(series2)

## Output
#False

#Case 4: Compare two Series having the same shape but different data
series1 = pd.Series([1,2,3,4])
series2 = pd.Series([1,2,4,4])
series1.equals(series2)

## Output
#False

False

In [4]:
df["device_id"].equals(df1["device_id"])
#Output
#True

df["device_temperature"].equals(df1["device_temperature"])
#Output
#False

False

In [3]:
df.equals(df1)

False

In [5]:
print("List of the columns having different values in the DataFrames df1 and df \n")
for column in df.columns:
    if df[column].equals(df1[column]):
        pass
    else:
        print(column)


# Output
#List of the columns having different values in the DataFrames df1 and df 

#device_temperature
#device_status

List of the columns having different values in the DataFrames df1 and df

device_temperature
device_status

In [6]:
df2 = pd.concat([df, df1])
df2

  device_id  device_temperature device_status
0      D475                35.4      Inactive
1      D175                45.2        Active
2      D200                59.3        Active
3      D375                49.3        Active
4      M475                32.2        Active
5      M400                35.7      Inactive
6      M250                36.8        Active
7      A150                34.9        Active
0      D475                39.4        Active
1      D175                45.2        Active
2      D200                29.3      Inactive
3      D375                49.3        Active
4      M475                32.2        Active
5      M400                35.7      Inactive
6      M250                36.8        Active
7      A150                24.9      Inactive

In [7]:
df3 = df2.drop_duplicates(keep=False)
df3

  device_id  device_temperature device_status
0      D475                35.4      Inactive
2      D200                59.3        Active
7      A150                34.9        Active
0      D475                39.4        Active
2      D200                29.3      Inactive
7      A150                24.9      Inactive

In [8]:
df4 = df.compare(df1)
df4

  device_temperature       device_status
                self other          self     other
0               35.4  39.4      Inactive    Active
2               59.3  29.3        Active  Inactive
7               34.9  24.9        Active  Inactive